Ralim/IronOS/source/Core/BSP/Pinecilv2/bl_mcu_sdk/drivers/bl702_driver/regs/pwm_reg.h
    /* 0x20 : pwm0_clkdiv */
    union {
        struct
        {
            uint32_t pwm_clk_div    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_clkdiv;

    /* 0x24 : pwm0_thre1 */
    union {
        struct
        {
            uint32_t pwm_thre1      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_thre1;

    /* 0x28 : pwm0_thre2 */
    union {
        struct
        {
            uint32_t pwm_thre2      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_thre2;

    /* 0x2C : pwm0_period */
    union {
        struct
        {
            uint32_t pwm_period     : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_period;

    /* 0x30 : pwm0_config */
    union {
        struct
        {
            uint32_t reg_clk_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t pwm_out_inv      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pwm_sw_force_val : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pwm_sw_mode      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t pwm_sts_top      : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_config;

    /* 0x34 : pwm0_interrupt */
    union {
        struct
        {
            uint32_t pwm_int_period_cnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_enable     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31     : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm0_interrupt;

    /* 0x38  reserved */
    uint8_t RESERVED0x38[8];

    /* 0x40 : pwm1_clkdiv */
    union {
        struct
        {
            uint32_t pwm_clk_div    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm1_clkdiv;

    /* 0x44 : pwm1_thre1 */
    union {
        struct
        {
            uint32_t pwm_thre1      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm1_thre1;

    /* 0x48 : pwm1_thre2 */
    union {
        struct
        {
            uint32_t pwm_thre2      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm1_thre2;

    /* 0x4C : pwm1_period */
    union {
        struct
        {
            uint32_t pwm_period     : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm1_period;

    /* 0x50 : pwm1_config */
    union {
        struct
        {
            uint32_t reg_clk_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t pwm_out_inv      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pwm_sw_force_val : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pwm_sw_mode      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t pwm_sts_top      : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm1_config;

    /* 0x54 : pwm1_interrupt */
    union {
        struct
        {
            uint32_t pwm_int_period_cnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_enable     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31     : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm1_interrupt;

    /* 0x58  reserved */
    uint8_t RESERVED0x58[8];

    /* 0x60 : pwm2_clkdiv */
    union {
        struct
        {
            uint32_t pwm_clk_div    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm2_clkdiv;

    /* 0x64 : pwm2_thre1 */
    union {
        struct
        {
            uint32_t pwm_thre1      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm2_thre1;

    /* 0x68 : pwm2_thre2 */
    union {
        struct
        {
            uint32_t pwm_thre2      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm2_thre2;

    /* 0x6C : pwm2_period */
    union {
        struct
        {
            uint32_t pwm_period     : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm2_period;

    /* 0x70 : pwm2_config */
    union {
        struct
        {
            uint32_t reg_clk_sel      : 2;  /* [ 1: 0],        r/w,        0x0 */
            uint32_t pwm_out_inv      : 1;  /* [    2],        r/w,        0x0 */
            uint32_t pwm_stop_mode    : 1;  /* [    3],        r/w,        0x1 */
            uint32_t pwm_sw_force_val : 1;  /* [    4],        r/w,        0x0 */
            uint32_t pwm_sw_mode      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t pwm_stop_en      : 1;  /* [    6],        r/w,        0x0 */
            uint32_t pwm_sts_top      : 1;  /* [    7],          r,        0x0 */
            uint32_t reserved_8_31    : 24; /* [31: 8],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm2_config;

    /* 0x74 : pwm2_interrupt */
    union {
        struct
        {
            uint32_t pwm_int_period_cnt : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t pwm_int_enable     : 1;  /* [   16],        r/w,        0x0 */
            uint32_t reserved_17_31     : 15; /* [31:17],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm2_interrupt;

    /* 0x78  reserved */
    uint8_t RESERVED0x78[8];

    /* 0x80 : pwm3_clkdiv */
    union {
        struct
        {
            uint32_t pwm_clk_div    : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm3_clkdiv;

    /* 0x84 : pwm3_thre1 */
    union {
        struct
        {
            uint32_t pwm_thre1      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm3_thre1;

    /* 0x88 : pwm3_thre2 */
    union {
        struct
        {
            uint32_t pwm_thre2      : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm3_thre2;

    /* 0x8C : pwm3_period */
    union {
        struct
        {
            uint32_t pwm_period     : 16; /* [15: 0],        r/w,        0x0 */
            uint32_t reserved_16_31 : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } pwm3_period;

